maspendig/esp32-avb/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ESP_NETIF_L2_TAP=y
# Increase L2TAP RX queue for high-rate AVB streams (default 20 is too small)
CONFIG_ESP_NETIF_L2_TAP_RX_QUEUE_SIZE=100

CONFIG_ETHERNET_INTERNAL_SUPPORT=y
CONFIG_ETHERNET_PHY_IP101=y

CONFIG_NETUTILS_PTPD=y
CONFIG_NETUTILS_PTPD_CLIENT=y
CONFIG_NETUTILS_PTPD_SERVER=y

CONFIG_NETUTILS_PTPD_PRIORITY1=246
CONFIG_NETUTILS_PTPD_SERVERPRIO=100
CONFIG_NETUTILS_PTPD_TIMEOUT_MS=10000
CONFIG_NETUTILS_PTPD_SETTIME_THRESHOLD_MS=100
CONFIG_EXAMPLE_PTP_PULSE_GPIO=20
CONFIG_EXAMPLE_PTP_PULSE_WIDTH_NS=250000000
